<script setup>
import {useActionLogStore} from "@/store/modules/index.js"
import {UIPageContent, UIStructure} from "@/components/index.js"
import Filter from "./ui/Filter.vue"
const store = useActionLogStore()
const organizations = [
  {
    "id": 474,
    "name": "\"Ўзбекистон темир йўллари\" АЖ",
    "full_name": "\"Ўзбекистон темир йўллари\" АЖ",
    "children": [
      {
        "id": 475,
        "name": "Марказий аппарат",
        "full_name": "",
        "children": [
          {
            "id": 476,
            "name": "Трансфомация офиси (НТ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 477,
            "name": "Коррупцияга қарши курашиш бошқармаси (НК)",
            "full_name": "",
            "children": []
          },
          {
            "id": 478,
            "name": "Бошқарув раиси ҳузуридаги котибият (НГК)",
            "full_name": "",
            "children": []
          },
          {
            "id": 479,
            "name": "Логистик жараёнлар маркетинг таҳлили маркази (НМ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 480,
            "name": "Халқаро ҳамкорлик ва ташқи иқтисодий алоқалар департамети (НИ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 481,
            "name": "Инвестицияларни жалб қилиш ва инвестиция лойиҳаларини амалга оширишни департамети (ДИ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 482,
            "name": "Иқтисодий таҳлил ва прогнозлаш департаменти (НН)",
            "full_name": "",
            "children": []
          },
          {
            "id": 483,
            "name": "Молия департаменти (НФ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 484,
            "name": "Акциядорлар билан корпоратив муносабатлар департамети (НКО)",
            "full_name": "",
            "children": []
          },
          {
            "id": 485,
            "name": "Темирйўлтаъмин бошқармаси (НХ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 486,
            "name": "Жамият раҳбарияти",
            "full_name": "",
            "children": []
          },
          {
            "id": 487,
            "name": "Жамиятнинг Москва шаҳридаги ваколатхонаси",
            "full_name": "",
            "children": []
          },
          {
            "id": 488,
            "name": "Махсус хизмат (НР)",
            "full_name": "",
            "children": []
          },
          {
            "id": 489,
            "name": "Персонални бошқариш ва кадрларни тайёрлаш департаменти (НОК)",
            "full_name": "",
            "children": []
          },
          {
            "id": 490,
            "name": "Юридик депаратмент (НЮ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 491,
            "name": "Киберхавфсизлик бошқармаси (НКБ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 492,
            "name": "Стратегия ва самарадорлик лойиҳа офиси (Лойиха офиси)",
            "full_name": "",
            "children": []
          }
        ]
      },
      {
        "id": 493,
        "name": "\"1-сон Энергомонтаж поезди\" МЧЖ (ЭП-1)",
        "full_name": "",
        "children": []
      },
      {
        "id": 494,
        "name": "\"Андижон механика заводи\" АЖ (АМЗ)",
        "full_name": "",
        "children": [
          {
            "id": 495,
            "name": "Пахтабод филиали (Пахтабод филиали)",
            "full_name": "",
            "children": []
          }
        ]
      },
      {
        "id": 496,
        "name": "\"Эйвалек махсус темир бетон\" МЧЖ (ЭМТБ)",
        "full_name": "",
        "children": []
      },
      {
        "id": 497,
        "name": "\"1-сон қурилиш-монтаж поезди\" МЧЖ (СМП-1)",
        "full_name": "",
        "children": []
      },
      {
        "id": 498,
        "name": "\"Ўзтемирйўлмаштаъмир\" АЖ (ТРЗ)",
        "full_name": "",
        "children": []
      },
      {
        "id": 499,
        "name": "\"Қуюв механика заводи\" АЖ (ЛМЗ)",
        "full_name": "",
        "children": []
      },
      {
        "id": 500,
        "name": "\"Тошкент йўловчи вагонлирни қуриш ва таъмирлаш заводи\" АЖ (ТВСРЗ)",
        "full_name": "",
        "children": []
      },
      {
        "id": 501,
        "name": "\"14-сон Рельс пайвандлаш поезди\" МЧЖ (РСП-14)",
        "full_name": "",
        "children": []
      },
      {
        "id": 502,
        "name": "\"Ўзтемирйўлконтейнер\" АЖ (ЖДК)",
        "full_name": "",
        "children": []
      },
      {
        "id": 503,
        "name": "\"Гранит\" АЖ (Гранит)",
        "full_name": "",
        "children": []
      },
      {
        "id": 504,
        "name": "\"Темирйўлэкспресс\" АЖ (ЛЭКС)",
        "full_name": "",
        "children": []
      },
      {
        "id": 505,
        "name": "\"Темирйўлкарго\" АЖ (КАРГО)",
        "full_name": "",
        "children": []
      },
      {
        "id": 506,
        "name": "Ижро аппарати",
        "full_name": "",
        "children": [
          {
            "id": 507,
            "name": "Стратегик ривожлантириш, саноат фаолиятини ташкил (НСР)",
            "full_name": "",
            "children": []
          },
          {
            "id": 508,
            "name": "Техник ва технологик назорат бошқармасси (РБ - УТТК)",
            "full_name": "",
            "children": []
          },
          {
            "id": 509,
            "name": "Юк ва тижорат ишлари бошқармаси (М)",
            "full_name": "",
            "children": []
          },
          {
            "id": 510,
            "name": "Статистика ва ҳисобга олиш бошқармаси (НЧ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 511,
            "name": "Ички аудит хизмати (СВА)",
            "full_name": "",
            "children": []
          },
          {
            "id": 512,
            "name": "Ёшлар етакчилари кенгаши (СЛМ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 513,
            "name": "Ишларни бошқариш дирекцияси (УДН)",
            "full_name": "",
            "children": []
          },
          {
            "id": 514,
            "name": "Ташишларни ташкил этиш бошқармаси (Д)",
            "full_name": "",
            "children": []
          },
          {
            "id": 515,
            "name": "Жамиятнинг Гомел шаҳридаги ваколатхонаси (г.Гомель)",
            "full_name": "",
            "children": []
          },
          {
            "id": 516,
            "name": "Вагон хужалиги",
            "full_name": "",
            "children": [
              {
                "id": 517,
                "name": "Тошкент юк вагон депоси (ВЧД-1)",
                "full_name": "",
                "children": []
              },
              {
                "id": 518,
                "name": "Қўқон вагон депоси (ВЧД-4)",
                "full_name": "",
                "children": []
              },
              {
                "id": 519,
                "name": "Бухоро вагон депоси (ВЧД-7)",
                "full_name": "",
                "children": []
              },
              {
                "id": 520,
                "name": "Кунғирот вагон депо (ВЧД-14)",
                "full_name": "",
                "children": []
              },
              {
                "id": 521,
                "name": "Қарши вагон депоси (ВЧД-8)",
                "full_name": "",
                "children": []
              },
              {
                "id": 522,
                "name": "Термиз вагон депоси (ВЧД-16)",
                "full_name": "",
                "children": []
              },
              {
                "id": 523,
                "name": "Вагон хўжалиги бошқармаси (В)",
                "full_name": "",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "id": 524,
        "name": "Бошқа бўлинмалар",
        "full_name": "",
        "children": [
          {
            "id": 525,
            "name": "\"Ўзтемирйўлэкспедиция\" МЧЖ (ЖДЭ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 526,
            "name": "Ахборот ҳисоблаш маркази (ИВЦ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 527,
            "name": "Ахборот таҳлил медиа маркази (ИАЦ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 528,
            "name": "\"Сагдиана транс\" МЧЖ (Сагдиана)",
            "full_name": "",
            "children": []
          },
          {
            "id": 529,
            "name": "Угам-Чоткол давлат биосфера резервати (НБР)",
            "full_name": "",
            "children": []
          },
          {
            "id": 530,
            "name": "\"Ўзбекистон\" локомотив депоси (ТЧ-1)",
            "full_name": "",
            "children": []
          },
          {
            "id": 531,
            "name": "Махсус дирекция (СД)",
            "full_name": "",
            "children": []
          },
          {
            "id": 532,
            "name": "Ўзтемирйўлҳисоб маркази (ЖДР)",
            "full_name": "",
            "children": []
          },
          {
            "id": 533,
            "name": " DIGITAL AUTOMATIC SMART (\"DAS UTY\" МЧЖ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 534,
            "name": "Капитал қурилиш дирекцияси (НОКС)",
            "full_name": "",
            "children": []
          },
          {
            "id": 535,
            "name": "Ҳарбийлаштирилган қўриқлаш бошқармаси (НО)",
            "full_name": "",
            "children": [
              {
                "id": 536,
                "name": "Тошкент ҳарбийлаштирилган қўриқлаш отряди (НОР-1)",
                "full_name": "",
                "children": []
              },
              {
                "id": 537,
                "name": "Қўқон ҳарбийлаштирилган қўриқлаш отряди (НОР-2)",
                "full_name": "",
                "children": []
              },
              {
                "id": 538,
                "name": "Бухоро ҳарбийлаштирилган қўриқлаш отряди (НОР-3)",
                "full_name": "",
                "children": []
              },
              {
                "id": 539,
                "name": "Қўнғирот ҳарбийлаштирилган қўриқлаш отряди (НОР-4)",
                "full_name": "",
                "children": []
              },
              {
                "id": 540,
                "name": "Қарши ҳарбийлаштирилган қўриқлаш отряди (НОР-5)",
                "full_name": "",
                "children": []
              },
              {
                "id": 541,
                "name": "Ўзбекистон стац. ҳарбий. қўриқлаш отряди (НОР-6)",
                "full_name": "",
                "children": []
              },
              {
                "id": 542,
                "name": "Тошкент стац. ҳарбий. қўриқлаш отряди (НОР-7)",
                "full_name": "",
                "children": []
              },
              {
                "id": 543,
                "name": "Қамчиқ ҳарбийлаштирилган қўриқлаш отряди (НОР-8)",
                "full_name": "",
                "children": []
              },
              {
                "id": 544,
                "name": "Термиз ҳарбийлаштирилган қўриқлаш отряди (НОР-9)",
                "full_name": "",
                "children": []
              },
              {
                "id": 545,
                "name": "НОР-10 (НОР-10)",
                "full_name": "",
                "children": []
              }
            ]
          },
          {
            "id": 546,
            "name": "ТЭР",
            "full_name": "",
            "children": [
              {
                "id": 547,
                "name": "ТЭР \"Темирйўлёнилғитаъмин\" (ТЭР)",
                "full_name": "",
                "children": []
              },
              {
                "id": 548,
                "name": "Тошкент бирлашган ёнилғи омбор хўжалиги ()",
                "full_name": "",
                "children": []
              },
              {
                "id": 549,
                "name": "Қўқон бирлашган ёнилғи омбор хўжалиги ()",
                "full_name": "",
                "children": []
              },
              {
                "id": 550,
                "name": "Самарқанд бирлашган ёнилғи омбор хўжалиги ()",
                "full_name": "",
                "children": []
              },
              {
                "id": 551,
                "name": "Қарши бирлашган ёнилғи омбор хўжалиги ()",
                "full_name": "",
                "children": []
              },
              {
                "id": 552,
                "name": "Термиз бирлашган ёнилғи омбор хўжалиги ()",
                "full_name": "",
                "children": []
              },
              {
                "id": 553,
                "name": "Бухоро бирлашган ёнилғи омбор хўжалиги ()",
                "full_name": "",
                "children": []
              },
              {
                "id": 554,
                "name": "Мискен бирлашган ёнилғи омбор хўжалиги ()",
                "full_name": "",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "id": 555,
        "name": "\"Темирйўлинфратузилма\" АЖ",
        "full_name": "",
        "children": [
          {
            "id": 556,
            "name": "Мониторинг ва диагностика маркази (ЦМД)",
            "full_name": "",
            "children": []
          },
          {
            "id": 557,
            "name": "Ягона диспетчерлик маркази (ЕДЦ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 558,
            "name": "Йўл хўжалиги бошқармаси (П)",
            "full_name": "",
            "children": []
          },
          {
            "id": 559,
            "name": "Локомотивлардан фойдаланиш бошқармаси (УЭЛ-Т)",
            "full_name": "",
            "children": []
          },
          {
            "id": 560,
            "name": "Алоқа ва сигналлаштириш бошкармаси (Ш)",
            "full_name": "",
            "children": []
          },
          {
            "id": 561,
            "name": "Электртаъминот бошқармаси (Э)",
            "full_name": "",
            "children": []
          },
          {
            "id": 562,
            "name": "Марказий аппарат",
            "full_name": "",
            "children": []
          },
          {
            "id": 563,
            "name": "\"Темирйўлинфратузилма махсус қурилиш\" МЧЖ (ТМҚ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 564,
            "name": "Personalni tayyorlash muassasasi (PTM)",
            "full_name": "",
            "children": []
          },
          {
            "id": 565,
            "name": "Юридик бошқарма (СЮ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 566,
            "name": "РЖУ-1",
            "full_name": "",
            "children": [
              {
                "id": 567,
                "name": "Салар темир йўл масофаси (ПЧ-1)",
                "full_name": "",
                "children": []
              },
              {
                "id": 568,
                "name": "Тошкент темир йўл масофаси (ПЧ-2)",
                "full_name": "",
                "children": []
              },
              {
                "id": 569,
                "name": "Ховос темир йўл масофаси (ПЧ-4)",
                "full_name": "",
                "children": []
              },
              {
                "id": 570,
                "name": "Жиззах темир йўл масофаси (ПЧ-5)",
                "full_name": "",
                "children": []
              },
              {
                "id": 571,
                "name": "Тошкент сигнализация ва алоқа масофаси (ШЧ-1)",
                "full_name": "",
                "children": []
              },
              {
                "id": 572,
                "name": "Ховос сигнализация ва алоқа масофаси (ШЧ-3)",
                "full_name": "",
                "children": []
              },
              {
                "id": 573,
                "name": "Тошкент электр таъминоти масофаси (ЭЧ-1)",
                "full_name": "",
                "children": []
              },
              {
                "id": 574,
                "name": "Ховос электр таъминоти масофаси (ЭЧ-2)",
                "full_name": "",
                "children": []
              },
              {
                "id": 575,
                "name": "203-сон Тажриба йўл машина станцияси (ОПМС-203)",
                "full_name": "",
                "children": []
              },
              {
                "id": 576,
                "name": "Тошкент минтақавий темир йўл узели филиали (МТУ хусусий)",
                "full_name": "",
                "children": []
              },
              {
                "id": 577,
                "name": "Филиал Ржу",
                "full_name": "",
                "children": [
                  {
                    "id": 578,
                    "name": "Тошкент сув таъминоти ва биноларни сақлаш масофаси (ВОДЧ-1)",
                    "full_name": "",
                    "children": []
                  },
                  {
                    "id": 579,
                    "name": "Бекобод темир йўл станцияси (Бекобод станцияси)",
                    "full_name": "",
                    "children": []
                  },
                  {
                    "id": 580,
                    "name": "Жиззах темир йўл станцияси (Жиззах станцияси)",
                    "full_name": "",
                    "children": []
                  },
                  {
                    "id": 581,
                    "name": "Ховос темир йўл станцияси (Ховос станцияси)",
                    "full_name": "",
                    "children": []
                  },
                  {
                    "id": 582,
                    "name": "Чуқурсой темир йўл станцияси (Чуқурсой станцияси)",
                    "full_name": "",
                    "children": []
                  },
                  {
                    "id": 583,
                    "name": "Тошкент таъмирлаш-қурилиш участкаси (ТТК)",
                    "full_name": "",
                    "children": []
                  },
                  {
                    "id": 584,
                    "name": "Ховос моддий техник таъминот бўлими (НОДХ)",
                    "full_name": "",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "id": 585,
            "name": "РЖУ-2",
            "full_name": "",
            "children": [
              {
                "id": 586,
                "name": "Олтариқ вагонларни буғлаб ювиш корхонаси (ВЧН)",
                "full_name": "",
                "children": []
              },
              {
                "id": 587,
                "name": "Қамчиқ темир йўл масофаси (ПЧ-3)",
                "full_name": "",
                "children": []
              },
              {
                "id": 588,
                "name": "Қўқон темир йўл масофаси (ПЧ-6)",
                "full_name": "",
                "children": []
              },
              {
                "id": 589,
                "name": "Андижон темир йўл масофаси (ПЧ-7)",
                "full_name": "",
                "children": []
              },
              {
                "id": 590,
                "name": "Қўқон локомотив депоси (ТЧ-2)",
                "full_name": "",
                "children": [
                  {
                    "id": 591,
                    "name": "Қўқон локомотив депоси Андижон филиали (Андижон филиали)",
                    "full_name": "",
                    "children": []
                  }
                ]
              },
              {
                "id": 592,
                "name": "Қўқон алоқа ва сигналлаштириш масофаси (ШЧ-4)",
                "full_name": "",
                "children": []
              },
              {
                "id": 593,
                "name": "Қўқон электр таъминоти масофаси (ЭЧ-3)",
                "full_name": "",
                "children": []
              },
              {
                "id": 594,
                "name": "164-сон Йўл машина станцияси (ПМС-164)",
                "full_name": "",
                "children": []
              },
              {
                "id": 595,
                "name": "Қўқон минтақавий темир йўл узели филиали (МТУ хусусий)",
                "full_name": "",
                "children": []
              },
              {
                "id": 596,
                "name": "Филиал РЖУ",
                "full_name": "",
                "children": [
                  {
                    "id": 597,
                    "name": " Қўқон таъмирлаш-қурилиш участкаси (РСУ)",
                    "full_name": "",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "id": 598,
            "name": "РЖУ-3",
            "full_name": "",
            "children": [
              {
                "id": 599,
                "name": "Самарқанд темир йўл масофаси (ПЧ-8)",
                "full_name": "",
                "children": []
              },
              {
                "id": 600,
                "name": "Учкудук темир йўл масофаси (ПЧ-9)",
                "full_name": "",
                "children": []
              },
              {
                "id": 601,
                "name": "Бухоро темир йўл масофаси (ПЧ-10)",
                "full_name": "",
                "children": []
              },
              {
                "id": 602,
                "name": "Зиёвудин темир йўл масофаси (ПЧ-11)",
                "full_name": "",
                "children": []
              },
              {
                "id": 603,
                "name": "Тинчлик локомотив депоси (ТЧ-5)",
                "full_name": "",
                "children": []
              },
              {
                "id": 604,
                "name": "Бухоро локомотив депоси (ТЧ-6)",
                "full_name": "",
                "children": []
              },
              {
                "id": 605,
                "name": "Самарқанд алоқа ва ишорат масофаси (ШЧ-5)",
                "full_name": "",
                "children": []
              },
              {
                "id": 606,
                "name": "Навоий алока ва ишорат масофаси (ШЧ-6)",
                "full_name": "",
                "children": []
              },
              {
                "id": 607,
                "name": "Бухоро алока ва ишорат масофаси (ШЧ-7)",
                "full_name": "",
                "children": []
              },
              {
                "id": 608,
                "name": "Бухоро электр таъминот дистанцияси (ЭЧ-4)",
                "full_name": "",
                "children": []
              },
              {
                "id": 609,
                "name": "Самарканд электр таъминот дистанцияси (ЭЧ-8)",
                "full_name": "",
                "children": []
              },
              {
                "id": 610,
                "name": "Қоровулбозор темир йўл бекати (ДС-К)",
                "full_name": "",
                "children": []
              },
              {
                "id": 611,
                "name": "Бухоро йўл хизмати устахонаси (ПДМ)",
                "full_name": "",
                "children": []
              },
              {
                "id": 612,
                "name": "17-сон Йўл машина станцияси (ПМС-17)",
                "full_name": "",
                "children": []
              },
              {
                "id": 613,
                "name": "Бухоро минтақавий темир йўл узели филиали (МТУ хусусий)",
                "full_name": "",
                "children": []
              },
              {
                "id": 614,
                "name": "Қорлитоғ темир йўл масофаси филиали (ПЧ-16)",
                "full_name": "",
                "children": []
              }
            ]
          },
          {
            "id": 615,
            "name": "РЖУ-4",
            "full_name": "",
            "children": [
              {
                "id": 616,
                "name": "Урганч темир йўл масофаси (ПЧ-18)",
                "full_name": "",
                "children": []
              },
              {
                "id": 617,
                "name": "Қўнғирот темир йўл масофаси (ПЧ-25)",
                "full_name": "",
                "children": []
              },
              {
                "id": 618,
                "name": "Қорақалпоқ темир йўл масофаси (ПЧ-26)",
                "full_name": "",
                "children": []
              },
              {
                "id": 619,
                "name": "Қўнғирот локомотив депоси (ТЧ-7)",
                "full_name": "",
                "children": []
              },
              {
                "id": 620,
                "name": "Урганч локомотив депо (ТЧ-10)",
                "full_name": "",
                "children": []
              },
              {
                "id": 621,
                "name": "Урганч сигналлаштириш ва алоқа масофаси (ШЧ-10)",
                "full_name": "",
                "children": []
              },
              {
                "id": 622,
                "name": "Қўнғирот сигналлаштириш ва алоқа масофаси (ШЧ-11)",
                "full_name": "",
                "children": []
              },
              {
                "id": 623,
                "name": "Мискин электр таъминоти масофаси (ЭЧ-9)",
                "full_name": "",
                "children": []
              },
              {
                "id": 624,
                "name": "Қўнғирот электр таъминоти масофаси (ЭЧ-10)",
                "full_name": "",
                "children": []
              },
              {
                "id": 625,
                "name": "279-сон Йўл машина станцияси (ПМС-279)",
                "full_name": "",
                "children": []
              },
              {
                "id": 626,
                "name": "Қўнғирот минтақавий темир йўл узели филиали (МТУ хусусий)",
                "full_name": "",
                "children": []
              },
              {
                "id": 627,
                "name": "Филиал РЖУ",
                "full_name": "",
                "children": [
                  {
                    "id": 628,
                    "name": "Ургенч дирекция (Ургенч дирекция)",
                    "full_name": "",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "id": 629,
            "name": "РЖУ-5",
            "full_name": "",
            "children": [
              {
                "id": 630,
                "name": "Қарши темир йўл таъмирлаш корхонаси (ПЧ-12)",
                "full_name": "",
                "children": []
              },
              {
                "id": 631,
                "name": "Қашқадарё темир йўл таъмирлаш корхонаси (ПЧ-14)",
                "full_name": "",
                "children": []
              },
              {
                "id": 632,
                "name": "Қарши локомотив депоси (ТЧ-8)",
                "full_name": "",
                "children": []
              },
              {
                "id": 633,
                "name": "Қарши алоқа ва ишорат муассасаси (ШЧ-8)",
                "full_name": "",
                "children": []
              },
              {
                "id": 634,
                "name": "Қарши электр таъминоти корхонаси (ЭЧ-5)",
                "full_name": "",
                "children": []
              },
              {
                "id": 635,
                "name": "214-сон Йўл машина станцияси (ПМС-214)",
                "full_name": "",
                "children": []
              },
              {
                "id": 636,
                "name": "Қарши минтақавий темир йўл узели филиали (МТУ хусусий)",
                "full_name": "",
                "children": []
              },
              {
                "id": 637,
                "name": "Филиал РЖУ",
                "full_name": "",
                "children": [
                  {
                    "id": 638,
                    "name": "Қарши темир йўл станцияси (Қарши станцияси)",
                    "full_name": "",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "id": 639,
            "name": "РЖУ-6",
            "full_name": "",
            "children": [
              {
                "id": 640,
                "name": "Термиз темир йўл масофа корхонаси (ПЧ-13)",
                "full_name": "",
                "children": []
              },
              {
                "id": 641,
                "name": "Дарбанд темир йўл масофа корхонаси (ПЧ-15)",
                "full_name": "",
                "children": []
              },
              {
                "id": 642,
                "name": "Термиз локомотив депоси (ТЧ-9)",
                "full_name": "",
                "children": []
              },
              {
                "id": 643,
                "name": "Термиз алока ва ишорат корхонаси (ШЧ-9)",
                "full_name": "",
                "children": []
              },
              {
                "id": 644,
                "name": "Термиз электр таьминоти корхонаси (ЭЧ-7)",
                "full_name": "",
                "children": []
              },
              {
                "id": 645,
                "name": "166-сон Йўл машина станцияси (ПМС-166)",
                "full_name": "",
                "children": []
              },
              {
                "id": 646,
                "name": "Термиз минтақавий темир йўл узели филиали (МТУ хусусий)",
                "full_name": "",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "id": 647,
        "name": "\"Тошкент механика заводи\" АЖ (ТМЗ АО)",
        "full_name": "",
        "children": [
          {
            "id": 648,
            "name": "\"Андижон механика корхонаси\" МЧЖ (АМК)",
            "full_name": "",
            "children": []
          },
          {
            "id": 649,
            "name": "\"Фарғона механика заводи\" МЧЖ (ФМЗ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 650,
            "name": "\"Тошкент механика заводи\" АЖ (ТМЗ)",
            "full_name": "",
            "children": []
          }
        ]
      },
      {
        "id": 651,
        "name": "\"Темир йўл ижтимоий хизматлар\" муассасаси (НСУ)",
        "full_name": "",
        "children": [
          {
            "id": 652,
            "name": "Марказий клиник касалхонаси (Марказий касалхона)",
            "full_name": "",
            "children": []
          },
          {
            "id": 653,
            "name": "Марказий поликлиника (Марказий поликлиника)",
            "full_name": "",
            "children": []
          },
          {
            "id": 654,
            "name": "\"O'ZBEKISTON TEMIR YO'LLARI\" AJ YO'L BOLALAR KASALXONASI DM (Болалар касалхонаси)",
            "full_name": "",
            "children": []
          },
          {
            "id": 655,
            "name": "Саломатлик тиббий-санитар ёрдам поезди (\"Саломатлик\" ТСЁП)",
            "full_name": "",
            "children": []
          },
          {
            "id": 656,
            "name": "Қўқон темир йўл шифохонаси (Қўқон бекати касалхонаси)",
            "full_name": "",
            "children": []
          },
          {
            "id": 657,
            "name": "Андижон темир йўл шифохонаси (Андижон шифохонаси)",
            "full_name": "",
            "children": []
          },
          {
            "id": 658,
            "name": "Самарқанд темир йўл шифохонаси (Самарқанд шифохонаси)",
            "full_name": "",
            "children": []
          },
          {
            "id": 659,
            "name": "Бухоро темир йўл шифохонаси (Бухоро шифохонаси)",
            "full_name": "",
            "children": []
          },
          {
            "id": 660,
            "name": "Қарши темир йўл шифохонаси (Қарши шифохонаси)",
            "full_name": "",
            "children": []
          },
          {
            "id": 661,
            "name": "Термиз темир йўл шифохонаси (Термиз шифохонаси)",
            "full_name": "",
            "children": []
          },
          {
            "id": 662,
            "name": "Урганч темир йўл шифохонаси (Урганч шифохонаси)",
            "full_name": "",
            "children": []
          },
          {
            "id": 663,
            "name": "Хўжайли темир йўл шифохонаси (Хўжайли шифохонаси)",
            "full_name": "",
            "children": []
          },
          {
            "id": 664,
            "name": "Қўнғирот темир йўл шифохонаси (Қўнғирот шифохонаси)",
            "full_name": "",
            "children": []
          },
          {
            "id": 665,
            "name": "Қўнғирот санаторий профилакторийси (Қўнғирот СП)",
            "full_name": "",
            "children": []
          },
          {
            "id": 666,
            "name": "Марказий санитария эпидемиология станцияси (Марказий СЭС)",
            "full_name": "",
            "children": []
          },
          {
            "id": 667,
            "name": "Ховос тармоқ санитария-эпидемиология станцияси (Ховос СЭС)",
            "full_name": "",
            "children": []
          },
          {
            "id": 668,
            "name": "Қўқон тармоқ санитария-эпидемиология станцияси (Қўқон СЭС)",
            "full_name": "",
            "children": []
          },
          {
            "id": 669,
            "name": "Андижон тармоқ санитария-эпидемиология станцияси (Андижон СЭС)",
            "full_name": "",
            "children": []
          },
          {
            "id": 670,
            "name": "Самарқанд тармоқ санитария-эпидемиология станцияси (Самарқанд СЭС)",
            "full_name": "",
            "children": []
          },
          {
            "id": 671,
            "name": "Бухоро тармоқ санитария-эпидемиология станцияси (Бухоро СЭС)",
            "full_name": "",
            "children": []
          },
          {
            "id": 672,
            "name": "Қарши тармоқ санитария-эпидемиология станцияси (Қарши СЭС)",
            "full_name": "",
            "children": []
          },
          {
            "id": 673,
            "name": "Термиз тармоқ санитария-эпидемиология станцияси (Термиз СЭС)",
            "full_name": "",
            "children": []
          },
          {
            "id": 674,
            "name": "Қўнғирот тармоқ санитария-эпидемиология станцияси (Қўнғирот СЭС)",
            "full_name": "",
            "children": []
          },
          {
            "id": 675,
            "name": "Ховос темир йўл шифохонаси (Ховос шифохонаси)",
            "full_name": "",
            "children": []
          },
          {
            "id": 676,
            "name": "\"Темир йўл ижтимоий хизматлар\" муассасаси (НСУ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 677,
            "name": "Локомотив жисмоний спорт клуби (ЦФСК)",
            "full_name": "",
            "children": [
              {
                "id": 678,
                "name": "Бухоро филиали",
                "full_name": "",
                "children": []
              },
              {
                "id": 679,
                "name": "Карши филиали",
                "full_name": "",
                "children": []
              },
              {
                "id": 680,
                "name": "Самарканд филиали",
                "full_name": "",
                "children": []
              },
              {
                "id": 681,
                "name": "Кунгират филиали",
                "full_name": "",
                "children": []
              },
              {
                "id": 682,
                "name": "Кукон филиали",
                "full_name": "",
                "children": []
              },
              {
                "id": 683,
                "name": "Ургенч филиали",
                "full_name": "",
                "children": []
              }
            ]
          },
          {
            "id": 684,
            "name": "Сиҳатгоҳ санаторий-профилакторий (Сиҳатгоҳ)",
            "full_name": "",
            "children": []
          },
          {
            "id": 685,
            "name": "Темирйўлчилар маданият саройи (Маданият саройи)",
            "full_name": "",
            "children": []
          },
          {
            "id": 686,
            "name": "Темирйўлчи болалар дам олиш оромгоҳи (Темирйўлчи оромгоҳи)",
            "full_name": "",
            "children": []
          },
          {
            "id": 687,
            "name": "Қибрай болалар дам олиш оромгоҳи (Қибрай оромгоҳи)",
            "full_name": "",
            "children": []
          },
          {
            "id": 688,
            "name": "Янги авлод болалар дам олиш оромгоҳи (Янги авлод оромгоҳи)",
            "full_name": "",
            "children": []
          },
          {
            "id": 689,
            "name": "Бурчимулло болалар дам олиш оромгоҳи (Бурчимулло оромгоҳи)",
            "full_name": "",
            "children": []
          },
          {
            "id": 690,
            "name": "Оловиддин болалар дам олиш оромгоҳи (Оловиддин оромгоҳи)",
            "full_name": "",
            "children": []
          }
        ]
      },
      {
        "id": 691,
        "name": "\"Ўзвагонтаъмир\" АЖ (УВТ)",
        "full_name": "",
        "children": [
          {
            "id": 692,
            "name": "Ховос вагон депоси (ВЧД-3)",
            "full_name": "",
            "children": []
          },
          {
            "id": 693,
            "name": "Андижон вагон депоси (ВЧД-5)",
            "full_name": "",
            "children": []
          },
          {
            "id": 694,
            "name": "Самарқанд вагон депоси (ВЧД-6)",
            "full_name": "",
            "children": []
          },
          {
            "id": 695,
            "name": "Жамия бошқарув аппарати",
            "full_name": "",
            "children": []
          }
        ]
      },
      {
        "id": 696,
        "name": "\"Ўзтемирйўлйўловчи\" АЖ (Л)",
        "full_name": "",
        "children": [
          {
            "id": 697,
            "name": "\"Ўзтемирйўлйўловчи\" АЖ (Бошқарув аппарати)",
            "full_name": "",
            "children": []
          },
          {
            "id": 698,
            "name": "Филиаллар",
            "full_name": "",
            "children": [
              {
                "id": 699,
                "name": "Халқаро йўналишларда йўловчиларга хизмат кўр.фил",
                "full_name": "",
                "children": []
              },
              {
                "id": 700,
                "name": "ВЧД-2 филиал",
                "full_name": "",
                "children": []
              },
              {
                "id": 701,
                "name": "Тезюрар йўналишларда йўловчиларга хиз.кўр филиали",
                "full_name": "",
                "children": []
              },
              {
                "id": 702,
                "name": "Оролбўйи филиали",
                "full_name": "",
                "children": []
              },
              {
                "id": 703,
                "name": "Маҳаллий йўналишларда йўловчиларга хизмат кўрсатиш филиали",
                "full_name": "",
                "children": []
              },
              {
                "id": 704,
                "name": "Андижон филиали",
                "full_name": "",
                "children": []
              }
            ]
          },
          {
            "id": 705,
            "name": "\"Шаҳар атрофида йўловчи ташиш\" МЧЖ (ЛША)",
            "full_name": "",
            "children": []
          },
          {
            "id": 706,
            "name": "\"Темийўлвокзаллари\" МЧЖ (ЛТВ)",
            "full_name": "",
            "children": []
          }
        ]
      }
    ]
  }
]

const tree = ref([])

onMounted(()=>{
  store._getActionLog()
})

const onSelect = (v)=>{
    if(tree.value.includes(v.id)){
      tree.value = tree.value.filter((x)=>x !== v.id)
    }else{
      tree.value.push(v.id)
    }

  console.log(tree.value)
}
</script>

<template>
<UIPageContent>
  <Filter/>
<!--<Tabs/>-->
  <div class="w-[600px]">
    <UIStructure
        :data="organizations"
        :modelV="tree"
        @onSelect="onSelect"
    />
  </div>
</UIPageContent>
</template>
